Config/InformationRegisters/СоответствиеСчетовОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеСчетовОС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетАмортизации</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетОбесценения</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗабалансовыйСчет</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетПередачиВАренду</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетПередачиВПользование</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетПередачиВУправление</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетОС</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/АмортизационныеГруппыОКОФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АмортизационныеГруппыОКОФ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОКОФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбщероссийскийКлассификаторОсновныхФондов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АмортизационнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АмортизационныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ВидыИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыИмущества</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НедвижимоеИмущество</Name>
					<Comment>Аналитическая группа 10</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДвижимоеОсобоЦенное</Name>
					<Comment>Аналитическая группа 20</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИноеДвижимое</Name>
					<Comment>Аналитическая группа 30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лизинг</Name>
					<Comment>Аналитическая группа 40</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аренда</Name>
					<Comment>Аналитическая группа 40</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казна</Name>
					<Comment>Аналитическая группа 50</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПраваПользованияНМА</Name>
					<Comment>Аналитическая группа 60</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВКонцессии</Name>
					<Comment>Аналитическая группа 90</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыНФА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыНФА</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НМА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НПА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапВложения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПраваПользованияИмуществом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казна</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыУчетаНФА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыУчетаНФА</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаБалансе</Name>
					<Comment>Счета 101, 102, 103, 108, 21</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Арендованные</Name>
					<Comment>Счета 01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаОтветственномХранении</Name>
					<Comment>Счета 02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапВложение</Name>
					<Comment>Счета 106</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
					<Comment>Счета 107</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/СпособНачисленияАмортизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособНачисленияАмортизации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриВводеВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Линейный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УменьшаемогоОстатка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноОбъемуПродукции</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/ChartsOfAccounts/ЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfAccounts>
		<Properties>
			<Name>ЕПСБУ</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользоватьВПроводках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КОСГУДт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КОСГУКт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезДетализацииКОСГУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляКазенных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляБюджетных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляАвтономных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьНеУказыватьПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоКПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоКЭК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>НалоговыйУчетНеУчитываемых</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>НалоговыйУчетЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>НалоговыйУчетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Суммовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

Config/CommonModules/УправлениеОсновнымиСредствамиПовтИсп/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция СчетАмортизацииОС(СчетУчетаОС) Экспорт
	
	Возврат УправлениеОсновнымиСредствами.ВсеСчетаУчетаОС(СчетУчетаОС).СчетАмортизации;
	
КонецФункции

Функция СчетОбесцененияОС(СчетУчетаОС) Экспорт
	
	Возврат УправлениеОсновнымиСредствами.ВсеСчетаУчетаОС(СчетУчетаОС).СчетОбесценения;
	
КонецФункции

Функция ЗабалансовыйСчетОС(СчетУчетаОС) Экспорт
	
	Возврат УправлениеОсновнымиСредствами.ВсеСчетаУчетаОС(СчетУчетаОС).ЗабалансовыйСчет;
	
КонецФункции

Функция СчетПередачиОСвУправление(СчетУчетаОС) Экспорт
	
	Возврат УправлениеОсновнымиСредствами.ВсеСчетаУчетаОС(СчетУчетаОС).СчетПередачиВУправление;
	
КонецФункции

Функция СчетПередачиОСВАренду(СчетУчетаОС) Экспорт
	
	Возврат УправлениеОсновнымиСредствами.ВсеСчетаУчетаОС(СчетУчетаОС).СчетПередачиВАренду;
	
КонецФункции

Функция СчетПередачиОСВПользование(СчетУчетаОС) Экспорт
	
	Возврат УправлениеОсновнымиСредствами.ВсеСчетаУчетаОС(СчетУчетаОС).СчетПередачиВПользование;
	
КонецФункции

Функция СчетУчетаПоЗабалансовомуСчетуОС(ЗабалансовыйСчетОС) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЗабалансовыйСчетОС) Тогда
		Возврат ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СоответствиеСчетовОС.СчетОС КАК СчетУчета,
	|	СоответствиеСчетовОС.ЗабалансовыйСчет КАК ЗабалансовыйСчет
	|ИЗ
	|	РегистрСведений.СоответствиеСчетовОС КАК СоответствиеСчетовОС
	|ГДЕ
	|	СоответствиеСчетовОС.ЗабалансовыйСчет = &ЗабалансовыйСчетОС";
	Запрос.УстановитьПараметр("ЗабалансовыйСчетОС", ЗабалансовыйСчетОС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СчетУчета;
	Иначе
		Возврат ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция СчетаУчетаОСПоВидам() Экспорт
	
	Запрос = Новый Запрос;
	//101.00
	СчетаПоВидамИмущества = Новый Соответствие;
	СчетаПоВидамИмущества.Вставить("101.10", Перечисления.ВидыИмущества.НедвижимоеИмущество);
	СчетаПоВидамИмущества.Вставить("101.20", Перечисления.ВидыИмущества.ДвижимоеОсобоЦенное);
	СчетаПоВидамИмущества.Вставить("101.30", Перечисления.ВидыИмущества.ИноеДвижимое);
	СчетаПоВидамИмущества.Вставить("101.40", Перечисления.ВидыИмущества.Лизинг);
	СчетаПоВидамИмущества.Вставить("101.90", Перечисления.ВидыИмущества.ВКонцессии);
	
	ШаблонЗапросаОС =
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ЕПСБУ.ЭлементГруппа КАК ЭлементГруппа,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыНФА.ОС) КАК ВидНФА,
	|	&ВидИмущества КАК ВидИмущества,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""1""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЖилыеПомещения,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""2""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НежилыеПомещения,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""3""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Сооружения,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""4""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Машины,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""5""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Транспорт,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""6""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ХозИнвентарь,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""7""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Библиотека,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""8""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Прочие,
	|	Ложь КАК Аренда,
	|	Ложь КАК Хранение,
	|	NULL КАК БудущийВидНФА,
	|	Ложь КАК ПолученныеПоЦС,
	|	ЕПСБУ.Порядок
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.Ссылка В (&Родитель)";
	
	ИндексЗапросов = 0;
	ПервыйЗапрос = Истина;
	Для каждого СчетВидИмущества Из СчетаПоВидамИмущества Цикл
	
		Если НЕ ПервыйЗапрос Тогда
			Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("Все");
		КонецЕсли;
		ПервыйЗапрос = Ложь;
		Запрос.Текст = Запрос.Текст
		+ СтрЗаменить(СтрЗаменить(ШаблонЗапросаОС, "&ВидИмущества", "&ВидИмущества" + ИндексЗапросов),
			"&Родитель", "&Родитель" + ИндексЗапросов);
		Запрос.УстановитьПараметр("ВидИмущества" + ИндексЗапросов, СчетВидИмущества.Значение);
		Запрос.УстановитьПараметр("Родитель" + ИндексЗапросов, БухгалтерскийУчет.СписокСчетов(СчетВидИмущества.Ключ));
		ИндексЗапросов = ИндексЗапросов + 1;
	
	КонецЦикла;
	
	// 102.00, 103.00
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("Все") +
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ЕПСБУ.ЭлементГруппа КАК ЭлементГруппа,
	|	ВЫБОР
	|		КОГДА ЕПСБУ.Ссылка В (&Счет103)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНФА.НПА)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыНФА.НМА)
	|	КОНЕЦ КАК ВидНФА,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 5, 1) = ""1""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.НедвижимоеИмущество)
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 5, 1) = ""2""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ДвижимоеОсобоЦенное)
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 5, 1) = ""3""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ИноеДвижимое)
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 5, 1) = ""4""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.Лизинг)
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 5, 1) = ""9""
	|			ТОГДА ВЫБОР
	|					КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""1""
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.НедвижимоеИмущество)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ВКонцессии)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ПустаяСсылка)
	|	КОНЕЦ КАК ВидИмущества,
	|	NULL КАК ЖилыеПомещения,
	|	NULL КАК НежилыеПомещения,
	|	NULL КАК Сооружения,
	|	NULL КАК Машины,
	|	NULL КАК Транспорт,
	|	NULL КАК ХозИнвентарь,
	|	NULL КАК Библиотека,
	|	NULL КАК Прочие,
	|	ЛОЖЬ КАК Аренда,
	|	ЛОЖЬ КАК Хранение,
	|	NULL КАК БудущийВидНФА,
	|	NULL КАК ПолученныеПоЦС,
	|	ЕПСБУ.Порядок КАК Порядок
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.Ссылка В (&Счет102, &Счет103)";
	
	Запрос.УстановитьПараметр("Счет102", БухгалтерскийУчет.СписокСчетов("102.00"));
	Запрос.УстановитьПараметр("Счет103", БухгалтерскийУчет.СписокСчетов("103.00"));
	
	// 106.00, 107.00
	СчетаПоВидамИмущества = Новый Соответствие;
	СчетаПоВидамИмущества.Вставить("106.10", Перечисления.ВидыИмущества.НедвижимоеИмущество);
	СчетаПоВидамИмущества.Вставить("106.20", Перечисления.ВидыИмущества.ДвижимоеОсобоЦенное);
	СчетаПоВидамИмущества.Вставить("106.30", Перечисления.ВидыИмущества.ИноеДвижимое);
	СчетаПоВидамИмущества.Вставить("106.40", Перечисления.ВидыИмущества.Лизинг);
	СчетаПоВидамИмущества.Вставить("106.90", Перечисления.ВидыИмущества.ВКонцессии);
	
	СчетаПоВидамИмущества.Вставить("107.10", Перечисления.ВидыИмущества.НедвижимоеИмущество);
	СчетаПоВидамИмущества.Вставить("107.20", Перечисления.ВидыИмущества.ДвижимоеОсобоЦенное);
	СчетаПоВидамИмущества.Вставить("107.30", Перечисления.ВидыИмущества.ИноеДвижимое);
	СчетаПоВидамИмущества.Вставить("107.40", Перечисления.ВидыИмущества.Лизинг);
	ШаблонЗапросаВложений =
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ЕПСБУ.ЭлементГруппа КАК ЭлементГруппа,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыНФА.КапВложения) КАК ВидНФА,
	|	&ВидИмущества КАК ВидИмущества,
	|	NULL КАК ЖилыеПомещения,
	|	NULL КАК НежилыеПомещения,
	|	NULL КАК Сооружения,
	|	NULL КАК Машины,
	|	NULL КАК Транспорт,
	|	NULL КАК ХозИнвентарь,
	|	NULL КАК Библиотека,
	|	NULL КАК Прочие,
	|	ЛОЖЬ КАК Аренда,
	|	ЛОЖЬ КАК Хранение,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) В (""1"", ""С"")
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНФА.ОС)
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""2""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНФА.НМА)
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""3""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНФА.НПА)
	|	КОНЕЦ КАК БудущийВидНФА,
	|	NULL КАК ПолученныеПоЦС,
	|	ЕПСБУ.Порядок КАК Порядок
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|		ПО ЕПСБУ.Ссылка = ЕПСБУВидыСубконто.Ссылка
	|ГДЕ
	|	ЕПСБУ.Ссылка В(&Родитель)
	|	И ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)";
	Для каждого СчетВидИмущества Из СчетаПоВидамИмущества Цикл
	
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("Все")
		+ СтрЗаменить(СтрЗаменить(ШаблонЗапросаВложений, "&ВидИмущества", "&ВидИмущества" + ИндексЗапросов),
			"&Родитель", "&Родитель" + ИндексЗапросов);
		Запрос.УстановитьПараметр("ВидИмущества" + ИндексЗапросов, СчетВидИмущества.Значение);
		Запрос.УстановитьПараметр("Родитель" + ИндексЗапросов, БухгалтерскийУчет.СписокСчетов(СчетВидИмущества.Ключ));
		ИндексЗапросов = ИндексЗапросов + 1;
	
	КонецЦикла;
	
	//108
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("Все") +
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ЕПСБУ.ЭлементГруппа КАК ЭлементГруппа,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""4""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНФА.НМА)
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""5""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНФА.НПА)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыНФА.ОС)
	|	КОНЕЦ КАК ВидНФА,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 5, 1) = ""5""
	|			ТОГДА ВЫБОР
	|					КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) В (""2"", ""3"", ""4"", ""7"")
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ИноеДвижимое)
	|					КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) В (""1"", ""5"")
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.НедвижимоеИмущество)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ПустаяСсылка)
	|				КОНЕЦ
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 5, 1) = ""9""
	|			ТОГДА ВЫБОР
	|					КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) В (""1"", ""5"")
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.НедвижимоеИмущество)
	|					КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) В (""2"")
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ИноеДвижимое)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ВКонцессии)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ПустаяСсылка)
	|	КОНЕЦ КАК ВидИмущества,
	|	NULL КАК ЖилыеПомещения,
	|	NULL КАК НежилыеПомещения,
	|	NULL КАК Сооружения,
	|	NULL КАК Машины,
	|	NULL КАК Транспорт,
	|	NULL КАК ХозИнвентарь,
	|	NULL КАК Библиотека,
	|	NULL КАК Прочие,
	|	ЛОЖЬ КАК Аренда,
	|	ЛОЖЬ КАК Хранение,
	|	NULL КАК БудущийВидНФА,
	|	NULL КАК ПолученныеПоЦС,
	|	ЕПСБУ.Порядок КАК Порядок
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|		ПО ЕПСБУ.Ссылка = ЕПСБУВидыСубконто.Ссылка
	|ГДЕ
	|	ЕПСБУ.Ссылка В(&Счет108)
	|	И ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)";
	
	Запрос.УстановитьПараметр("Счет108", БухгалтерскийУчет.СписокСчетов("108.00"));
	
	//111.60
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("Все") +
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ЕПСБУ.ЭлементГруппа КАК ЭлементГруппа,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыНФА.НМА) КАК ВидНФА,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ПустаяСсылка) КАК ВидИмущества,
	|	NULL КАК ЖилыеПомещения,
	|	NULL КАК НежилыеПомещения,
	|	NULL КАК Сооружения,
	|	NULL КАК Машины,
	|	NULL КАК Транспорт,
	|	NULL КАК ХозИнвентарь,
	|	NULL КАК Библиотека,
	|	NULL КАК Прочие,
	|	ЛОЖЬ КАК Аренда,
	|	ЛОЖЬ КАК Хранение,
	|	NULL КАК БудущийВидНФА,
	|	NULL КАК ПолученныеПоЦС,
	|	ЕПСБУ.Порядок КАК Порядок
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|		ПО ЕПСБУ.Ссылка = ЕПСБУВидыСубконто.Ссылка
	|ГДЕ
	|	ЕПСБУ.Ссылка В(&Счет111)
	|	И ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)";
	
	Запрос.УстановитьПараметр("Счет111", БухгалтерскийУчет.СписокСчетов("111.60"));
	
	// 01
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("Все") +
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ЕПСБУ.ЭлементГруппа КАК ЭлементГруппа,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыНФА.ОС) КАК ВидНФА,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 4, 1) = ""1""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.НедвижимоеИмущество)
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 4, 1) = ""2""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ДвижимоеОсобоЦенное)
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 4, 1) = ""3""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ИноеДвижимое)
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 4, 1) = ""4""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.Лизинг)
	|	КОНЕЦ КАК ВидИмущества,
	|	NULL КАК ЖилыеПомещения,
	|	NULL КАК НежилыеПомещения,
	|	NULL КАК Сооружения,
	|	NULL КАК Машины,
	|	NULL КАК Транспорт,
	|	NULL КАК ХозИнвентарь,
	|	NULL КАК Библиотека,
	|	NULL КАК Прочие,
	|	ИСТИНА КАК Аренда,
	|	ЛОЖЬ КАК Хранение,
	|	NULL КАК БудущийВидНФА,
	|	NULL КАК ПолученныеПоЦС,
	|	ЕПСБУ.Порядок КАК Порядок
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|		ПО ЕПСБУ.Ссылка = ЕПСБУВидыСубконто.Ссылка
	|ГДЕ
	|	ЕПСБУ.Ссылка В(&Счет01)
	|	И ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)";
	
	Запрос.УстановитьПараметр("Счет01", БухгалтерскийУчет.СписокСчетов("01"));
	
	// 02
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("Все") +
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ЕПСБУ.ЭлементГруппа КАК ЭлементГруппа,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыНФА.ОС) КАК ВидНФА,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 5, 1) = """"
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ПустаяСсылка)
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 4, 1) = ""5""
	|			ТОГДА ВЫБОР
	|					КОГДА ПОДСТРОКА(ЕПСБУ.Код, 5, 1) = ""1""
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.НедвижимоеИмущество)
	|					КОГДА ПОДСТРОКА(ЕПСБУ.Код, 5, 1) = ""2""
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ИноеДвижимое)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПОДСТРОКА(ЕПСБУ.Код, 4, 1) = ""1""
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.НедвижимоеИмущество)
	|				КОГДА ПОДСТРОКА(ЕПСБУ.Код, 4, 1) = ""2""
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ДвижимоеОсобоЦенное)
	|				КОГДА ПОДСТРОКА(ЕПСБУ.Код, 4, 1) = ""3""
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ИноеДвижимое)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ КАК ВидИмущества,
	|	NULL КАК ЖилыеПомещения,
	|	NULL КАК НежилыеПомещения,
	|	NULL КАК Сооружения,
	|	NULL КАК Машины,
	|	NULL КАК Транспорт,
	|	NULL КАК ХозИнвентарь,
	|	NULL КАК Библиотека,
	|	NULL КАК Прочие,
	|	ЛОЖЬ КАК Аренда,
	|	ИСТИНА КАК Хранение,
	|	NULL КАК БудущийВидНФА,
	|	NULL КАК ПолученныеПоЦС,
	|	ЕПСБУ.Порядок КАК Порядок
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|		ПО ЕПСБУ.Ссылка = ЕПСБУВидыСубконто.Ссылка
	|ГДЕ
	|	ЕПСБУ.Ссылка В(&Счет02)
	|	И ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)";
	
	Запрос.УстановитьПараметр("Счет02", БухгалтерскийУчет.СписокСчетов("02"));
	
	//21
	СчетаПоВидамИмущества = Новый Соответствие;
	СчетаПоВидамИмущества.Вставить("101.10", Перечисления.ВидыИмущества.НедвижимоеИмущество);
	СчетаПоВидамИмущества.Вставить("101.20", Перечисления.ВидыИмущества.ДвижимоеОсобоЦенное);
	СчетаПоВидамИмущества.Вставить("101.30", Перечисления.ВидыИмущества.ИноеДвижимое);
	СчетаПоВидамИмущества.Вставить("101.40", Перечисления.ВидыИмущества.Лизинг);
	
	ШаблонЗапросаОС =
	"ВЫБРАТЬ
	|	СоответствиеСчетовОС.ЗабалансовыйСчет КАК Ссылка,
	|	СоответствиеСчетовОС.ЗабалансовыйСчет.ЭлементГруппа КАК ЭлементГруппа,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыНФА.ОС) КАК ВидНФА,
	|	&ВидИмущества КАК ВидИмущества,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""1""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЖилыеПомещения,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""2""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НежилыеПомещения,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""3""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Сооружения,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""4""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Машины,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""5""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Транспорт,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""6""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ХозИнвентарь,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""7""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Библиотека,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""8""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Прочие,
	|	ИСТИНА КАК Аренда,
	|	ИСТИНА КАК Хранение,
	|	ИСТИНА КАК БудущийВидНФА,
	|	ИСТИНА КАК ПолученныеПоЦС,
	|	СоответствиеСчетовОС.ЗабалансовыйСчет.Порядок КАК ЗабалансовыйСчетПорядок
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСчетовОС КАК СоответствиеСчетовОС
	|		ПО ЕПСБУ.Ссылка = СоответствиеСчетовОС.СчетОС
	|ГДЕ
	|	ЕПСБУ.Ссылка В(&Родитель)
	|	И СоответствиеСчетовОС.ЗабалансовыйСчет <> ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)";
	
	Для каждого СчетВидИмущества Из СчетаПоВидамИмущества Цикл
	
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("Все");
		Запрос.Текст = Запрос.Текст
		+ СтрЗаменить(СтрЗаменить(ШаблонЗапросаОС, "&ВидИмущества", "&ВидИмущества" + ИндексЗапросов),
			"&Родитель", "&Родитель" + ИндексЗапросов);
		Запрос.УстановитьПараметр("ВидИмущества" + ИндексЗапросов, СчетВидИмущества.Значение);
		Запрос.УстановитьПараметр("Родитель" + ИндексЗапросов, БухгалтерскийУчет.СписокСчетов(СчетВидИмущества.Ключ));
		ИндексЗапросов = ИндексЗапросов + 1;
	
	КонецЦикла;
	
	// 22
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("Все") +
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ЕПСБУ.ЭлементГруппа КАК ЭлементГруппа,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыНФА.ОС) КАК ВидНФА,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ПустаяСсылка) КАК ВидИмущества,
	|	NULL КАК ЖилыеПомещения,
	|	NULL КАК НежилыеПомещения,
	|	NULL КАК Сооружения,
	|	NULL КАК Машины,
	|	NULL КАК Транспорт,
	|	NULL КАК ХозИнвентарь,
	|	NULL КАК Библиотека,
	|	NULL КАК Прочие,
	|	ЛОЖЬ КАК Аренда,
	|	ЛОЖЬ КАК Хранение,
	|	NULL КАК БудущийВидНФА,
	|	ИСТИНА КАК ПолученныеПоЦС,
	|	ЕПСБУ.Порядок КАК Порядок
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|		ПО ЕПСБУ.Ссылка = ЕПСБУВидыСубконто.Ссылка
	|ГДЕ
	|	ЕПСБУ.Ссылка В(&Счет22)
	|	И ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)";
	
	Запрос.УстановитьПараметр("Счет22", БухгалтерскийУчет.СписокСчетов("22"));
	
	Запрос.Текст = Запрос.Текст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Функция возвращает пределы стоимости ОС для определения
// способа начисления амортизации. Пределы стоимости периодические.
// Значение получается функцией УправлениеОсновнымиСредствами.ПолучитьПараметрыУчетаОС().
//
// Параметры:
//  ДатаРасчета	 - Дата - Дата получения параметров
// Возвращаемое значение:
// ФиксированнаяСтруктура - содержит ключи:
//	*ПервыйПределОС - Число - предел стоимости для списания при принятии к учету;
//	*ВторойПределОС - Число - предел стоимости для начисления 100% амортизации при принятии к учету.
Функция ПолучитьПределыОС(ДатаРасчета) Экспорт
	Возврат Новый ФиксированнаяСтруктура(УправлениеОсновнымиСредствами.ПолучитьПараметрыУчетаОС(ДатаРасчета));
КонецФункции

// Определяет ведется ли учет основных средств по подразделениям.
//
Функция ВедетсяУчетОСПоПодразделениям() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
		И ПланыСчетов.ЕПСБУ.УчетПоПодразделениямГруппы("ОС");
	
КонецФункции

// Определяет ведется ли учет имущества казны по подразделениям.
//
Функция ВедетсяУчетИКПоПодразделениям() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
		И ПланыСчетов.ЕПСБУ.УчетПоПодразделениямГруппы("ИК");
	
КонецФункции

Функция ВедетсяУчетПравПользованияПоПодразделениям() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
		И ПланыСчетов.ЕПСБУ.УчетПоПодразделениямГруппы("ППА");
	
КонецФункции


// Функция возвращает структуру, содержающую счет учета, амортизации и забалансовый счет по забалансовому счету ОС.
//
// Параметры:
//	СчетОС - ПланСчетовСсылка.
//
// Возвращаемое значение:
//	Структура, содержащая ключи:
//								- СчетОС
//								- СчетАмортизации
//								- ЗабалансовыйСчет
// 
Функция ОпределитьСвойстваОСПоЗабалансовомуСчету(ЗабалансовыйСчет) Экспорт
	
	СчетаУчетаОС = Новый Структура("СчетОС, СчетАмортизации, ЗабалансовыйСчет",
		ПланыСчетов.ЕПСБУ.ПустаяСсылка(), ПланыСчетов.ЕПСБУ.ПустаяСсылка(), ПланыСчетов.ЕПСБУ.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СоответствиеСчетовОС.СчетОС, ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) КАК СчетОС,
	|	ЕСТЬNULL(СоответствиеСчетовОС.СчетАмортизации, ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) КАК СчетАмортизации,
	|	ЕСТЬNULL(СоответствиеСчетовОС.ЗабалансовыйСчет, ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) КАК ЗабалансовыйСчет
	|ИЗ
	|	РегистрСведений.СоответствиеСчетовОС КАК СоответствиеСчетовОС
	|ГДЕ
	|	СоответствиеСчетовОС.ЗабалансовыйСчет = &ЗабалансовыйСчет";
	
	Запрос.УстановитьПараметр("ЗабалансовыйСчет", ЗабалансовыйСчет);
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		СчетаУчетаОС.СчетОС				= Выборка.СчетОС;
		СчетаУчетаОС.СчетАмортизации	= Выборка.СчетАмортизации;
		СчетаУчетаОС.ЗабалансовыйСчет	= Выборка.ЗабалансовыйСчет;
	КонецЕсли;
	
	Возврат СчетаУчетаОС;
	
КонецФункции

// Функция возвращает массив структур амортизационных групп по ОКОФ
//
// Параметры:
//	ОКОФ - СправочникСсылка.ОбщероссийскийКлассификаторОсновныхФондов - код по ОКОФ	
// 
// Возвращаемое значение:
// 	- Массив из структур с ключами:
//		- Группа - ПеречислениеСсылка.АмортизационныеГруппы
//		- Примечание - Строка
//
Функция ПолучитьАмортизационныеГруппы(ОКОФ) Экспорт
	
	АмортизационныеГруппы = Новый Массив;
	
	Если ЗначениеЗаполнено(ОКОФ) Тогда
		
		ЗапросОКОФ = Новый Запрос;
		ЗапросОКОФ.УстановитьПараметр("ОКОФ", ОКОФ);
		
		ЗапросОКОФ.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АмортизационныеГруппыОКОФ.ОКОФ,
		|	АмортизационныеГруппыОКОФ.АмортизационнаяГруппа КАК Группа,
		|	АмортизационныеГруппыОКОФ.Примечание КАК Примечание
		|ИЗ
		|	РегистрСведений.АмортизационныеГруппыОКОФ КАК АмортизационныеГруппыОКОФ
		|ГДЕ
		|	АмортизационныеГруппыОКОФ.ОКОФ = &ОКОФ
		|
		|УПОРЯДОЧИТЬ ПО
		|	АмортизационныеГруппыОКОФ.АмортизационнаяГруппа.Порядок
		|";
		
		Выборка = ЗапросОКОФ.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Новый Структура("Группа, Примечание");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			АмортизационныеГруппы.Добавить(НоваяСтрока);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат АмортизационныеГруппы;
	
КонецФункции

Функция ВидНФАпоСчетуУчета(СчетУчета) Экспорт
	
	Возврат УправлениеОсновнымиСредствамиКлиентСервер.ВидНФАпоСчетуУчета(СчетУчета);
	
КонецФункции

Функция ВидУчетаПоСчетуУчета(СчетУчета) Экспорт
	
	Возврат Перечисления.ВидыУчетаНФА.ПоСчету(СчетУчета);
	//Возврат УправлениеОсновнымиСредствамиКлиентСервер.ВидУчетаПоСчетуУчета(СчетУчета);
	
КонецФункции

Функция ВидИмуществаПоСчетуУчета(СчетУчета) Экспорт
	
	Возврат Перечисления.ВидыИмущества.ПоСчету(СчетУчета);
	
КонецФункции

Функция ВидНФАПоСчетуВложения(СчетВложения) Экспорт
	
	Возврат УправлениеОсновнымиСредствамиКлиентСервер.ВидНФАПоСчетуВложения(СчетВложения);
	
КонецФункции

// Возвращает массив счетов учета ОС.
// ПараметрыПолученияСчетовОС - Структура возвращаемая функцией УправлениеОсновнымиСредствамиКлиентСервер.СтруктураЗапрашиваемыхСчетов()
//
Функция МассивСчетовОС(ПараметрыПолученияСчетовОС) Экспорт
	
	ЕстьБалансовыеСчета = ПараметрыПолученияСчетовОС.ЖилыеПомещения
		Или ПараметрыПолученияСчетовОС.НежилыеПомещения
		Или ПараметрыПолученияСчетовОС.Сооружения
		Или ПараметрыПолученияСчетовОС.ИнвестНедвижимость
		Или ПараметрыПолученияСчетовОС.Машины
		Или ПараметрыПолученияСчетовОС.Транспорт
		Или ПараметрыПолученияСчетовОС.ХозИнвентарь
		Или ПараметрыПолученияСчетовОС.Биоресурсы
		Или ПараметрыПолученияСчетовОС.Библиотека
		Или ПараметрыПолученияСчетовОС.Прочие;
	
	Если ПараметрыПолученияСчетовОС.ВидИмущества = Перечисления.ВидыИмущества.НедвижимоеИмущество Тогда
		Родитель101 = "101.10";
		Родитель102 = "102.10";
		Родитель103 = "103.10";
		Родитель106 = "106.10";
	ИначеЕсли ПараметрыПолученияСчетовОС.ВидИмущества = Перечисления.ВидыИмущества.ДвижимоеОсобоЦенное Тогда
		Родитель101 = "101.20";
		Родитель102 = "102.20";
		Родитель103 = "103.20";
		Родитель106 = "106.20";
	ИначеЕсли ПараметрыПолученияСчетовОС.ВидИмущества = Перечисления.ВидыИмущества.ИноеДвижимое Тогда
		Родитель101 = "101.30";
		Родитель102 = "102.30";
		Родитель103 = "103.30";
		Родитель106 = "106.30";
	ИначеЕсли ПараметрыПолученияСчетовОС.ВидИмущества = Перечисления.ВидыИмущества.Лизинг Тогда
		Родитель101 = "101.40";
		Родитель102 = "102.40";
		Родитель103 = "103.40";
		Родитель106 = "106.40";
	ИначеЕсли ПараметрыПолученияСчетовОС.ВидИмущества = Перечисления.ВидыИмущества.ВКонцессии Тогда
		Родитель101 = "101.90";
		Родитель102 = "";
		Родитель103 = "103.90";
		Родитель106 = "106.90";
	Иначе
		Родитель101 = "101.00";
		Родитель102 = "102.00";
		Родитель103 = "103.00";
		Родитель106 = "106.00";
	КонецЕсли;
	
	Родитель108 = Новый Массив;
	
	Если ПараметрыПолученияСчетовОС.ИК Тогда
		
		Родитель101 = "";
		Родитель102 = "";
		Родитель103 = "";
		Родитель106 = "";
		
		Если ПараметрыПолученияСчетовОС.ВидИмущества = Перечисления.ВидыИмущества.НедвижимоеИмущество
			ИЛИ ПараметрыПолученияСчетовОС.ВидИмущества = Перечисления.ВидыИмущества.Казна
			Или Не ЗначениеЗаполнено(ПараметрыПолученияСчетовОС.ВидИмущества) Тогда
			Если ПараметрыПолученияСчетовОС.ОС Тогда
				Родитель108.Добавить("108.51");
			ИначеЕсли ПараметрыПолученияСчетовОС.НПА Тогда
				Родитель108.Добавить("108.55");
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыПолученияСчетовОС.ВидИмущества = Перечисления.ВидыИмущества.ИноеДвижимое
			ИЛИ ПараметрыПолученияСчетовОС.ВидИмущества = Перечисления.ВидыИмущества.Казна
			Или Не ЗначениеЗаполнено(ПараметрыПолученияСчетовОС.ВидИмущества) Тогда
			Если ПараметрыПолученияСчетовОС.ОС Тогда
				Родитель108.Добавить("108.52");
				Родитель108.Добавить("108.53");
			ИначеЕсли ПараметрыПолученияСчетовОС.НМА Тогда
				Родитель108.Добавить("108.54");
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыПолученияСчетовОС.ВидИмущества = Перечисления.ВидыИмущества.ВКонцессии
			ИЛИ ПараметрыПолученияСчетовОС.ВидИмущества = Перечисления.ВидыИмущества.Казна
			Или Не ЗначениеЗаполнено(ПараметрыПолученияСчетовОС.ВидИмущества) Тогда
			Если ПараметрыПолученияСчетовОС.ОС Тогда
				Родитель108.Добавить("108.91");
				Родитель108.Добавить("108.92");
			ИначеЕсли ПараметрыПолученияСчетовОС.НПА Тогда
				Родитель108.Добавить("108.95");
			ИначеЕсли ПараметрыПолученияСчетовОС.НМА Тогда
				Родитель108.Добавить("108.9I");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ЧастиЗапроса = Новый Массив;
	
	Если ЕстьБалансовыеСчета И ЗначениеЗаполнено(Родитель101) Тогда
		
		Запрос.УстановитьПараметр("Родитель101", Родитель101);
		ЧастиЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ЕПСБУ.Ссылка КАК Ссылка
		|ИЗ
		|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
		|ГДЕ
		|	ЕПСБУ.Ссылка В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВТ.Ссылка
		|			ИЗ
		|				ПланСчетов.ЕПСБУ КАК ВТ
		|			ГДЕ
		|				ВТ.Код = &Родитель101)
		|	И ПОДСТРОКА(ЕПСБУ.Код, 6, 1) В (&П5)
		|	И ЕПСБУ.ЭлементГруппа = ЛОЖЬ");
		
		Массив5 = Новый Массив;
		Если ПараметрыПолученияСчетовОС.ЖилыеПомещения Тогда
			Массив5.Добавить("1");
		КонецЕсли;
		Если ПараметрыПолученияСчетовОС.НежилыеПомещения Тогда
			Массив5.Добавить("2");
		КонецЕсли;
		Если ПараметрыПолученияСчетовОС.Сооружения Тогда
			Массив5.Добавить("2");
			Массив5.Добавить("3");
			Если Не ПараметрыПолученияСчетовОС.ИнвестНедвижимость Тогда 
				ЧастиЗапроса[ЧастиЗапроса.ВГраница()] = ЧастиЗапроса[ЧастиЗапроса.ВГраница()] +
				" И ВЫБОР КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""3"" ТОГДА ЕПСБУ.Ссылка.ДатаНачалаДействия = ДАТАВРЕМЯ(1,1,1) ИНАЧЕ ИСТИНА КОНЕЦ";
			КонецЕсли;
		КонецЕсли;
		Если ПараметрыПолученияСчетовОС.ИнвестНедвижимость Тогда
			Массив5.Добавить("3");
			Если Не ПараметрыПолученияСчетовОС.Сооружения Тогда
				ЧастиЗапроса[ЧастиЗапроса.ВГраница()] = ЧастиЗапроса[ЧастиЗапроса.ВГраница()] +
				" И ВЫБОР КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""3"" ТОГДА ЕПСБУ.Ссылка.ДатаНачалаДействия = ДАТАВРЕМЯ(2018,1,1) ИНАЧЕ ИСТИНА КОНЕЦ";
			КонецЕсли;
		КонецЕсли;
		Если ПараметрыПолученияСчетовОС.Машины Тогда
			Массив5.Добавить("4");
		КонецЕсли;
		Если ПараметрыПолученияСчетовОС.Транспорт Тогда
			Массив5.Добавить("5");
		КонецЕсли;
		Если ПараметрыПолученияСчетовОС.ХозИнвентарь Тогда
			Массив5.Добавить("6");
		КонецЕсли;
		Если ПараметрыПолученияСчетовОС.Биоресурсы Тогда
			Массив5.Добавить("7");
			Если Не ПараметрыПолученияСчетовОС.Библиотека Тогда
				ЧастиЗапроса[ЧастиЗапроса.ВГраница()] = ЧастиЗапроса[ЧастиЗапроса.ВГраница()] +
				" И ВЫБОР КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""7"" ТОГДА ЕПСБУ.Ссылка.ДатаНачалаДействия = ДАТАВРЕМЯ(2018,1,1) ИНАЧЕ ИСТИНА КОНЕЦ";
			КонецЕсли;
		КонецЕсли;
		Если ПараметрыПолученияСчетовОС.Библиотека Тогда
			Массив5.Добавить("7");
			Массив5.Добавить("8");
			Если Не ПараметрыПолученияСчетовОС.Биоресурсы Тогда
				ЧастиЗапроса[ЧастиЗапроса.ВГраница()] = ЧастиЗапроса[ЧастиЗапроса.ВГраница()] +
				" И ВЫБОР КОГДА ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""7"" ТОГДА ЕПСБУ.Ссылка.ДатаНачалаДействия = ДАТАВРЕМЯ(1,1,1) ИНАЧЕ ИСТИНА КОНЕЦ";
			КонецЕсли;
		КонецЕсли;
		Если ПараметрыПолученияСчетовОС.Прочие Тогда
			Массив5.Добавить("8");
		КонецЕсли;
		Запрос.УстановитьПараметр("П5", Массив5);
		
	КонецЕсли;
	
	Если ПараметрыПолученияСчетовОС.НМА И ЗначениеЗаполнено(Родитель102) Тогда
		
		пРодитель102 = Новый Массив;
		пРодитель102.Добавить(Родитель102);
		Если Родитель102 <> "102.10" И Родитель102 <> "102.40" Тогда
			пРодитель102.Добавить("111.60");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Родитель102", пРодитель102);
		ЧастиЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ЕПСБУ.Ссылка КАК Ссылка
		|ИЗ
		|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
		|ГДЕ
		|	ЕПСБУ.Ссылка В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВТ.Ссылка
		|			ИЗ
		|				ПланСчетов.ЕПСБУ КАК ВТ
		|			ГДЕ
		|				ВТ.Код В (&Родитель102))
		|	И ЕПСБУ.ЭлементГруппа = ЛОЖЬ");
		
	КонецЕсли;
	
	Если ПараметрыПолученияСчетовОС.НПА И ЗначениеЗаполнено(Родитель103) Тогда
		
		Запрос.УстановитьПараметр("Родитель103", Родитель103);
		ЧастиЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ЕПСБУ.Ссылка КАК Ссылка
		|ИЗ
		|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
		|ГДЕ
		|	ЕПСБУ.Ссылка В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВТ.Ссылка
		|			ИЗ
		|				ПланСчетов.ЕПСБУ КАК ВТ
		|			ГДЕ
		|				ВТ.Код = &Родитель103)
		|	И ЕПСБУ.ЭлементГруппа = ЛОЖЬ");
		
	КонецЕсли;
	
	Если ПараметрыПолученияСчетовОС.КапВложения И ЗначениеЗаполнено(Родитель106) Тогда
		
		Запрос.УстановитьПараметр("Родитель106", Родитель106);
		ЧастиЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ЕПСБУ.Ссылка КАК Ссылка
		|ИЗ
		|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
		|		ПО ЕПСБУ.Ссылка = ЕПСБУВидыСубконто.Ссылка
		|			И (ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства))
		|ГДЕ
		|	ЕПСБУ.Ссылка В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВТ.Ссылка
		|			ИЗ
		|				ПланСчетов.ЕПСБУ КАК ВТ
		|			ГДЕ
		|				ВТ.Код = &Родитель106)
		|	И ЕПСБУ.ЭлементГруппа = ЛОЖЬ");
		
	КонецЕсли;
	
	Если ПараметрыПолученияСчетовОС.Аренда Тогда
		
		Запрос.УстановитьПараметр("Родитель01", "01");
		ЧастиЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ЕПСБУ.Ссылка КАК Ссылка
		|ИЗ
		|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
		|ГДЕ
		|	ЕПСБУ.Ссылка В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВТ.Ссылка
		|			ИЗ
		|				ПланСчетов.ЕПСБУ КАК ВТ
		|			ГДЕ
		|				ВТ.Код = &Родитель01)
		|	И ЕПСБУ.ЭлементГруппа = ЛОЖЬ");
		
	КонецЕсли;
	
	Если ПараметрыПолученияСчетовОС.Хранение Тогда
		
		Запрос.УстановитьПараметр("Родитель02", "02");
		ЧастиЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ЕПСБУ.Ссылка КАК Ссылка
		|ИЗ
		|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
		|		ПО ЕПСБУ.Ссылка = ЕПСБУВидыСубконто.Ссылка
		|			И (ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства))
		|ГДЕ
		|	ЕПСБУ.Ссылка В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВТ.Ссылка
		|			ИЗ
		|				ПланСчетов.ЕПСБУ КАК ВТ
		|			ГДЕ
		|				ВТ.Код = &Родитель02)
		|	И ЕПСБУ.ЭлементГруппа = ЛОЖЬ");
		
	КонецЕсли;
	
	Если ПараметрыПолученияСчетовОС.Свойство("ПолученныеПоЦС") И ПараметрыПолученияСчетовОС.ПолученныеПоЦС Тогда
		
		Запрос.УстановитьПараметр("Родитель22", "22");
		ЧастиЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ЕПСБУ.Ссылка КАК Ссылка
		|ИЗ
		|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
		|		ПО ЕПСБУ.Ссылка = ЕПСБУВидыСубконто.Ссылка
		|			И (ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства))
		|ГДЕ
		|	ЕПСБУ.Ссылка В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВТ.Ссылка
		|			ИЗ
		|				ПланСчетов.ЕПСБУ КАК ВТ
		|			ГДЕ
		|				ВТ.Код = &Родитель22)
		|	И ЕПСБУ.ЭлементГруппа = ЛОЖЬ");
		
	КонецЕсли;
	
	Если Родитель108.Количество() > 0 Тогда
		
		Запрос.УстановитьПараметр("Родитель108", Родитель108);
		ЧастиЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ЕПСБУ.Ссылка КАК Ссылка
		|ИЗ
		|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
		|ГДЕ
		|	ЕПСБУ.Ссылка В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВТ.Ссылка
		|			ИЗ
		|				ПланСчетов.ЕПСБУ КАК ВТ
		|			ГДЕ
		|				ВТ.Код В (&Родитель108))
		|	И ЕПСБУ.ЭлементГруппа = ЛОЖЬ");
		
	КонецЕсли;
	
	ТекстЗапроса = СтрСоединить(ЧастиЗапроса, ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("Все")); 
	
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		Результат = Новый Массив;
	Иначе
		Запрос.Текст = ТекстЗапроса;
		Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(Результат);
	
КонецФункции

Функция ВидНФАпоСчетуВложений(СчетВложений) Экспорт
	
	Результат = Перечисления.ВидыНФА.ПустаяСсылка(); // 106.24, 106.34, 106.44, 106.53, 106.56, 106.93
	
	Если ЗначениеЗаполнено(СчетВложений) Тогда
		Если БухгалтерскийУчет.СчетВИерархии(СчетВложений, "106.11,106.КС,106.21,106.31,106.41,106.51,106.52,106.91,106.92") Тогда
			Результат = Перечисления.ВидыНФА.ОС;
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(СчетВложений, "106.22,106.2D,106.2I,106.2N,106.2R,106.32,106.3D,106.3I,106.3N,106.3R,106.42,106.54,106.60,106.9I") Тогда
			Результат = Перечисления.ВидыНФА.НМА;
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(СчетВложений, "106.13,106.33,106.43,106.55,106.95") Тогда
			Результат = Перечисления.ВидыНФА.НПА;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СчетВложенийПоСчетуУчета(СчетУчетаОС) Экспорт
	Возврат УправлениеОсновнымиСредствами.СчетВложенийПоСчетуУчета(СчетУчетаОС);
КонецФункции

// Функция возвращает таблицу родителей по коду ОКОФ
//
Функция ВыбратьРодителейОКОФ(ОКОФ) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОбщероссийскийКлассификаторОсновныхФондов.Ссылка КАК Ссылка,
	|	0 КАК УровеньГруппировки
	|ИЗ
	|	Справочник.ОбщероссийскийКлассификаторОсновныхФондов КАК ОбщероссийскийКлассификаторОсновныхФондов
	|ГДЕ
	|	ОбщероссийскийКлассификаторОсновныхФондов.Ссылка = &ОКОФ
	|ИТОГИ
	|	СУММА(УровеньГруппировки)
	|ПО
	|	Ссылка ТОЛЬКО ИЕРАРХИЯ";
	
	Если ТипЗнч(ОКОФ) = Тип("Строка") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Ссылка = &ОКОФ", "Код = &ОКОФ");
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);	
	Запрос.УстановитьПараметр("ОКОФ", ОКОФ);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Инд = 0 По Результат.Количество() - 1 Цикл
		
		Результат[Инд].УровеньГруппировки = Результат.Количество() - Инд;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция РасшифровываемыеПоказателиРеглОтчета(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета) Экспорт
	
	ПоказателиОтчета = Новый Структура;
	РегламентированнаяОтчетностьБГУАвтозаполнение.ЗаполнитьПоказателиРегламентированногоОтчета(ПоказателиОтчета, ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета);
	
	Показатели = Новый Массив;
	
	Для Каждого Показатель Из ПоказателиОтчета Цикл
		Если Показатель.Значение[1] Тогда
			Показатели.Добавить(Показатель.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Показатели;
	
КонецФункции

// Формирует соответствие ссылок на способы начисления и их представлений
//
// Возвращаемое значение:
//  - Соответствие - ключ: ПеречислениеСсылка.СпособНачисленияАмортизации, Значение: стрококвое представление ссылки
Функция СпособыНачисленияАмортизации_Соответствие() Экспорт
	ПриВводеВЭксплуатацию = Перечисления.СпособНачисленияАмортизации.ПриВводеВЭксплуатацию; 
	ПриВводеВЭксплуатациюСтрока = Строка(ПриВводеВЭксплуатацию); 
	
	Линейный = Перечисления.СпособНачисленияАмортизации.Линейный; 
	ЛинейныйСтрока = Строка(Линейный);
	
	УменьшаемогоОстатка = Перечисления.СпособНачисленияАмортизации.УменьшаемогоОстатка; 
	УменьшаемогоОстаткаСтрока = Строка(УменьшаемогоОстатка);

	ПропорциональноОбъемуПродукции = Перечисления.СпособНачисленияАмортизации.ПропорциональноОбъемуПродукции; 
	ПропорциональноОбъемуПродукцииСтрока = Строка(ПропорциональноОбъемуПродукции);
	
	
	МетодыНачисления = Новый Соответствие;
	МетодыНачисления.Вставить(Перечисления.СпособНачисленияАмортизации.ПустаяСсылка(), "");
	МетодыНачисления.Вставить(ПриВводеВЭксплуатацию, ПриВводеВЭксплуатациюСтрока);
	МетодыНачисления.Вставить(Линейный, ЛинейныйСтрока);
	МетодыНачисления.Вставить(УменьшаемогоОстатка, УменьшаемогоОстаткаСтрока);
	МетодыНачисления.Вставить(ПропорциональноОбъемуПродукции, ПропорциональноОбъемуПродукцииСтрока);

	МетодыНачисления.Вставить("0", "");
	МетодыНачисления.Вставить("1", "");
	МетодыНачисления.Вставить("2", ПриВводеВЭксплуатациюСтрока);
	МетодыНачисления.Вставить("3", ЛинейныйСтрока);
	МетодыНачисления.Вставить("4", УменьшаемогоОстаткаСтрока);
	МетодыНачисления.Вставить("5", ПропорциональноОбъемуПродукцииСтрока);
		
	Возврат МетодыНачисления;
КонецФункции	
	
#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. Использовать МассивСчетовОС()
Функция ПолучитьМассивСчетовОС(	ВидИмущества = Неопределено,
								ЖилыеПомещения = Ложь,
								НежилыеПомещения = Ложь,
								Сооружения = Ложь,
								Машины = Ложь,
								Транспорт = Ложь,
								ХозИнвентарь = Ложь,
								Библиотека = Ложь,
								Прочие = Ложь,
								Аренда = Ложь,
								Хранение = Ложь) Экспорт
								
	СтруктураСчетов = УправлениеОсновнымиСредствамиКлиентСервер.СтруктураЗапрашиваемыхСчетов();
	СтруктураСчетов.ВидИмущества		= ВидИмущества;
	СтруктураСчетов.ЖилыеПомещения		= ЖилыеПомещения;
	СтруктураСчетов.НежилыеПомещения	= НежилыеПомещения;
	СтруктураСчетов.Сооружения			= Сооружения;
	СтруктураСчетов.Машины				= Машины;
	СтруктураСчетов.Транспорт			= Транспорт;
	СтруктураСчетов.ХозИнвентарь		= ХозИнвентарь;
	СтруктураСчетов.Библиотека			= Библиотека;
	СтруктураСчетов.Прочие				= Прочие;
	СтруктураСчетов.Аренда				= Аренда;
	СтруктураСчетов.Хранение			= Хранение;
	
	Возврат МассивСчетовОС(СтруктураСчетов);
	
	Результат = Новый Массив;
	
	Массив4 = Новый Массив;
	Если ВидИмущества = Неопределено Тогда
		Массив4.Добавить("1");
		Массив4.Добавить("2");
		Массив4.Добавить("3");
		Массив4.Добавить("4");
	ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.НедвижимоеИмущество Тогда
		Массив4.Добавить("1");
	ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.ДвижимоеОсобоЦенное Тогда
		Массив4.Добавить("2");
	ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.ИноеДвижимое Тогда
		Массив4.Добавить("3");
	ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.Лизинг Тогда
		Массив4.Добавить("4");
	КонецЕсли;
	
	Массив5 = Новый Массив;
	Если ЖилыеПомещения Тогда
		Массив5.Добавить("1");
	КонецЕсли;
	Если НежилыеПомещения Тогда
		Массив5.Добавить("2");
	КонецЕсли;
	Если Сооружения Тогда
		Массив5.Добавить("3");
	КонецЕсли;
	Если Машины Тогда
		Массив5.Добавить("4");
	КонецЕсли;
	Если Транспорт Тогда
		Массив5.Добавить("5");
	КонецЕсли;
	Если ХозИнвентарь Тогда
		Массив5.Добавить("6");
	КонецЕсли;
	Если Библиотека Тогда
		Массив5.Добавить("7");
	КонецЕсли;
	Если Прочие Тогда
		Массив5.Добавить("8");
	КонецЕсли;
	
	Для Каждого Тек4 Из Массив4 Цикл
		Для Каждого Тек5 Из Массив5 Цикл
			Счет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("101."+Тек4+Тек5);
			Если ЗначениеЗаполнено(Счет) Тогда
				Результат.Добавить(Счет);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если Аренда Тогда
		Счет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("01.11");
		Если ЗначениеЗаполнено(Счет) Тогда
			Результат.Добавить(Счет);
		КонецЕсли;
		Счет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("01.12");
		Если ЗначениеЗаполнено(Счет) Тогда
			Результат.Добавить(Счет);
		КонецЕсли;
		Счет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("01.21");
		Если ЗначениеЗаполнено(Счет) Тогда
			Результат.Добавить(Счет);
		КонецЕсли;
		Счет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("01.22");
		Если ЗначениеЗаполнено(Счет) Тогда
			Результат.Добавить(Счет);
		КонецЕсли;
		Счет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("01.31");
		Если ЗначениеЗаполнено(Счет) Тогда
			Результат.Добавить(Счет);
		КонецЕсли;
		Счет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("01.32");
		Если ЗначениеЗаполнено(Счет) Тогда
			Результат.Добавить(Счет);
		КонецЕсли;
	КонецЕсли;
	
	Если Хранение Тогда
		Счет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("02.1");
		Если ЗначениеЗаполнено(Счет) Тогда
			Результат.Добавить(Счет);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Устарела. Использовать УправлениеОсновнымиСредствамиКлиентСервер.ЭтоБиблиотечныйФонд().
Функция ЭтоБиблиотечныйФонд(СчетУчетаОС) Экспорт
	
	СтруктураСчетов = УправлениеОсновнымиСредствамиКлиентСервер.СтруктураЗапрашиваемыхСчетов();
	СтруктураСчетов.Библиотека = Истина;
	СчетаУчетаБиблиотечногоФонда = УправлениеОсновнымиСредствамиПовтИсп.МассивСчетовОС(СтруктураСчетов);
	
	Возврат (СчетаУчетаБиблиотечногоФонда.Найти(СчетУчетаОС) <> Неопределено);
	
КонецФункции

// Устарела. Использовать ВидИмуществаПоСчетуУчета
Функция ОпределитьВидИмуществаПоСчету(СчетУчета) Экспорт
	
	Возврат ВидИмуществаПоСчетуУчета(СчетУчета)
	
КонецФункции

// Устарела.
Функция ПолучитьСчетаУчетаЗданийСооружений() Экспорт
	
	КодыСчетов = "101.11,101.12,101.13,101.21,101.22,101.23,101.31,101.32,101.33,101.41,101.42,101.43";
	
	Возврат БухгалтерскийУчет.СписокСчетов(КодыСчетов, Истина);
	
КонецФункции

// Устарела.
Функция ПолучитьМассивСчетовУчетаНФА(ВидНФА, ВидУчета, ВидИмущества, ПолучатьКод = Ложь) Экспорт
	
	СписокСчетов = Новый Массив;
	
	Если ВидНФА = Перечисления.ВидыНФА.ОС Тогда 
		Если ВидУчета = ПредопределенноеЗначение("Перечисление.ВидыУчетаНФА.НаБалансе") 
			ИЛИ ВидУчета = Перечисления.ВидыУчетаНФА.ПустаяСсылка() Тогда
			Если Не ЗначениеЗаполнено(ВидИмущества) Тогда
				СписокСчетов.Добавить("101.00");
			ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.НедвижимоеИмущество Тогда
				СписокСчетов.Добавить("101.10");
			ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.ДвижимоеОсобоЦенное Тогда
				СписокСчетов.Добавить("101.20");
			ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.ИноеДвижимое Тогда
				СписокСчетов.Добавить("101.30");
			ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.Лизинг Тогда
				СписокСчетов.Добавить("101.40");
			КонецЕсли;
		КонецЕсли;
		Если ВидУчета = Перечисления.ВидыУчетаНФА.Арендованные 
			ИЛИ ВидУчета = Перечисления.ВидыУчетаНФА.ПустаяСсылка() Тогда
			Если Не ЗначениеЗаполнено(ВидИмущества) Тогда
				СписокСчетов.Добавить("01");
			ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.НедвижимоеИмущество Тогда
				СписокСчетов.Добавить("01.11");
				СписокСчетов.Добавить("01.12");
			ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.ДвижимоеОсобоЦенное Тогда
				СписокСчетов.Добавить("01.21");
				СписокСчетов.Добавить("01.22");
			ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.ИноеДвижимое Тогда
				СписокСчетов.Добавить("01.31");
				СписокСчетов.Добавить("01.32");
			КонецЕсли;
		КонецЕсли;
		Если ВидУчета = Перечисления.ВидыУчетаНФА.НаОтветственномХранении 
			Или ВидУчета = Перечисления.ВидыУчетаНФА.ПустаяСсылка() Тогда
			СписокСчетов.Добавить("02.1");
		КонецЕсли;
	ИначеЕсли ВидНФА = Перечисления.ВидыНФА.НМА Тогда
		Если ВидУчета = Перечисления.ВидыУчетаНФА.НаБалансе
			ИЛИ ВидУчета = Перечисления.ВидыУчетаНФА.ПустаяСсылка() Тогда
			Если Не ЗначениеЗаполнено(ВидИмущества) Тогда
				СписокСчетов.Добавить("102.00");
			ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.ДвижимоеОсобоЦенное Тогда
				СписокСчетов.Добавить("102.20");
			ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.ИноеДвижимое Тогда
				СписокСчетов.Добавить("102.30");
			ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.Лизинг Тогда
				СписокСчетов.Добавить("102.40");
			КонецЕсли;
		КонецЕсли;
		Если ВидУчета = Перечисления.ВидыУчетаНФА.Арендованные
			Или ВидУчета = Перечисления.ВидыУчетаНФА.ПустаяСсылка() Тогда
			Если Не ЗначениеЗаполнено(ВидИмущества) Тогда
				СписокСчетов.Добавить("01");
			ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.НедвижимоеИмущество Тогда
				СписокСчетов.Добавить("01.11");
				СписокСчетов.Добавить("01.12");
			ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.ДвижимоеОсобоЦенное Тогда
				СписокСчетов.Добавить("01.21");
				СписокСчетов.Добавить("01.22");
			ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.ИноеДвижимое Тогда
				СписокСчетов.Добавить("01.31");
				СписокСчетов.Добавить("01.32");
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ВидНФА = Перечисления.ВидыНФА.НПА Тогда
		Если ВидУчета = Перечисления.ВидыУчетаНФА.НаБалансе 
			Или ВидУчета = Перечисления.ВидыУчетаНФА.ПустаяСсылка() Тогда
			СписокСчетов.Добавить("103.00");
		КонецЕсли;
		Если ВидУчета = Перечисления.ВидыУчетаНФА.Арендованные
			Или ВидУчета = Перечисления.ВидыУчетаНФА.ПустаяСсылка() Тогда
			Если Не ЗначениеЗаполнено(ВидИмущества) Тогда
				СписокСчетов.Добавить("01");
			ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.НедвижимоеИмущество Тогда
				СписокСчетов.Добавить("01.11");
				СписокСчетов.Добавить("01.12");
			ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.ДвижимоеОсобоЦенное Тогда
				СписокСчетов.Добавить("01.21");
				СписокСчетов.Добавить("01.22");
			ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.ИноеДвижимое Тогда
				СписокСчетов.Добавить("01.31");
				СписокСчетов.Добавить("01.32");
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ВидНФА = Перечисления.ВидыНФА.КапВложения Тогда
		Если Не ЗначениеЗаполнено(ВидИмущества) Тогда
			СписокСчетов.Добавить("106.00");		
		ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.НедвижимоеИмущество Тогда
			СписокСчетов.Добавить("106.10");
		ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.ДвижимоеОсобоЦенное Тогда
			СписокСчетов.Добавить("106.20");
		ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.ИноеДвижимое Тогда
			СписокСчетов.Добавить("106.30");
		ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.Лизинг Тогда
			СписокСчетов.Добавить("106.40");
		КонецЕсли;
	КонецЕсли;
	
	Если СписокСчетов.Количество() = 0 Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Счет
	|ПОМЕСТИТЬ СчетаЕПСБУ
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.Код В(&МассивКодов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Результат
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|		ПО ЕПСБУ.Ссылка = ЕПСБУВидыСубконто.Ссылка
	|			И (ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства))
	|ГДЕ
	|	ЕПСБУ.Ссылка В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				СчетаЕПСБУ.Счет
	|			ИЗ
	|				СчетаЕПСБУ)
	|	И НЕ ЕПСБУ.ЭлементГруппа";
	
	Если ПолучатьКод Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЕПСБУ.Ссылка КАК Результат", "ЕПСБУ.Код КАК Результат");
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МассивКодов", СписокСчетов);
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Результат");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
